import { IProduct } from "../types/models";

export const product: IProduct[] = [
    {
        id: 1,
        title: 'TypeScript',
        desc: 'TypeScript - это любовь и боль современного веб-разработчика. Язык ненавидят за избыточную сложность системы типов, иллюзию безопасности и дополнительную рутину при разработке. Вместо того чтобы просто писать логику, программист вынужден часами описывать интерфейсы, дженерики и прописывать типы для сторонних библиотек, где эти типы кривые или отсутствуют. Чем интересен TS - Статическая типизация на этапе разработки: Ошибки вида undefined is not a function отлавливаются еще до запуска кода, прямо в редакторе. Безопасный и легкий рефакторинг: Можно переименовать поле в интерфейсе или поменять структуру данных, и IDE сама покажет все места в проекте, которые нужно обновить. Масштабируемость: На больших командах и крупных проектах код перестает превращаться в лапшу, потому что типы служат живой контрактной документацией.',
        image: 'https://images.icon-icons.com/2415/PNG/512/typescript_original_logo_icon_146317.png'

    },
    {
        id: 2,
        title: 'Fortran',
        desc: 'Дедушка, который всех переспорит. Это один из старейших и наиболее влиятельных языков программирования, созданный в 1957 году в IBM. Несмотря на свой почтенный возраст, он до сих пор активно используется, особенно в научных и инженерных вычислениях. Этого старичка обожают за - Исключительную скорость в математике: Он быстрее Си и многих других языков справляется с тяжелыми вычислениями на огромных многомерных матрицах. Гигантское научное наследие: На Фортране написаны вечные, проверенные десятилетиями библиотеки для линейной алгебры и физики (например, LAPACK, BLAS), которые никто не хочет (и не может смысла) переписывать с нуля. Непрерывная эволюция: Язык не застыл в прошлом - в него аккуратно добавили поддержку объектно-ориентированного программирования и параллельных вычислений, сохранив при этом обратную совместимость с древним кодом. На нем до сих пор считают погоду, моделируют аэродинамику, изучают космос и двигатели ракет, проводят ядерные и гидродинамические расчеты. Стальной характер: Это язык чистой логики и суровой инженерии без лишней «красивой мишуры» интерфейсов (GUI).',
        image: 'https://media.licdn.com/dms/image/v2/D4E12AQFA6PZAVSsxUg/article-cover_image-shrink_600_2000/article-cover_image-shrink_600_2000/0/1692266276722?e=2147483647&v=beta&t=kFhsVSBwxfKKqZXKupUIkILJUXWiH6uDqoo9TTGKaAw'
    }
]